//!1--------------------------------------------------------------------------
// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// const number = prompt('');
// if (Number(number) === 10) {
//   alert('Вірно');
// } else {
//   alert('Невірно');
// }
//!2-------------------------------------------------------------------------
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// const min = parseInt(Math.random() * 60);
// console.log(min);

// if (min <= 15) {
//   alert(`${min} входить в першу чверть`);
// } else if (min <= 30) {
//   alert(`${min} входить в другу чверть`);
// } else if (min <= 45) {
//   alert(`${min} входить в третю чверть`);
// } else if (min > 45) {
//   alert(`${min} входить в четверту чверть`);
// } else {
//   alert(`Виникла помилка`);
// }
//!3-----------------------------------------------------------------------
// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const num = parseInt(prompt('число'));
// let result = '';
// switch (num) {
//   case 1:
//     result = 'зима';
//     break;
//   case 2:
//     result = 'весна';
//     break;
//   case 3:
//     result = 'літо';
//     break;
//   case 4:
//     result = 'осінь';
//     break;
//   default:
//     result = 'Вибачте, але ви маєте ввести значення від 1 до 4 включно';
// }

// console.log(result);
//!4---------------------------------------------------------------------------
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

// const temp = parseInt(prompt('кількість хвилин'));
// const hours = String(Math.floor(temp / 60));
// const minutes = String(Math.floor(temp % 60));

// console.log(hours.padStart(2, '0') + ':' + minutes.padStart(2, '0'));
//!5--------------------------------------------------------------------------------
// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// let userLogin = '';
// let userPass = '';

// const login = prompt('enter login');
// if (login === '') {
//   alert('Скасовано');
// } else {
//   if (login === 'Admin') {
//     userPass = prompt('enter pass');
//     if (userPass === 'true') {
//       alert('Добрий день!');
//     } else {
//       alert('Невірний пароль!');
//     }
//   } else {
//     alert('Я вас не знаю');
//   }
// }
//!6--------------------------------------------------------------
// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// let num = 0;
// while (num <= 20) {
//   console.log(num++);
// }
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.
//!7--------------------------------------------------------------
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// function getNumbers(min, max) {
//   let result = 0;
//   for (let i = max; i >= min; i--) {
//     console.log(i);
//     if (i % 2 === 0) {
//       result += i;
//     }
//   }
//   return result;
// }
// console.log(getNumbers(3, 10));
//!8--------------------------------------------------------------------
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// function min(a, b) {
//   if (typeof a === 'number' && typeof b === 'number') {
//     return Math.min(a, b);
//   } else {
//     return 'Not a number';
//   }
// }

// console.log(min(2, 10));
//!9------------------------------------------------------------------------
// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

// function isAdult(age) {
//   return age >= 18 ? true : confirm();
// }

// console.log(isAdult(23));
//!10--------------------------------------------------------------------------
// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

// function fizzBuzz(num) {
//   for (let i = 1; i <= num; i++) {
//     if (i % 3 === 0 && i % 5 === 0) {
//       console.log(`${i} fizzbuzz`);
//     } else if (i % 5 === 0) {
//       console.log(`${i} buzz`);
//     } else if (i % 3 === 0) {
//       console.log(`${i} fizz`);
//     }
//   }
// }

// fizzBuzz(100);
//!Завдання з репозиторію https://github.com/FDevGoIt/Blended-1-module-1-2
// Написати функцію findFirstOccurrence, яка приймає два аргументи: рядок str і підрядок substr.
//  Функція повинна повертати індекс першого входження підрядка в рядок.
//  Якщо підрядок не знайдено, функція повинна повертати - 1.

// function findFirstOccurrence(str, substr) {
//   return str.indexOf(substr);
// }

// // Приклади використання:
// console.log(findFirstOccurrence('Hello, world!', 'world')); // 7
// console.log(findFirstOccurrence('Hello, world!', 'JavaScript')); // -1
// console.log(findFirstOccurrence('Hello, world!', 'Hello')); // 0
//!2-------------------------------------------------------------------------
// Написати функцію getSubstring, яка приймає три аргументи: рядок str,
// індекс початку start та індекс кінця end.
// Функція повинна повертати підрядок, що починається з індексу start
// і закінчується індексом end(не включаючи його).

// function getSubstring(str, indexStart, indextEnd) {
//   return str.slice(indexStart, indextEnd);
// }
// // Приклади використання:
// console.log(getSubstring('Hello, world!', 7, 12)); // "world"
// console.log(getSubstring('JavaScript', 4, 10)); // "Script"
// console.log(getSubstring('Slice method', 0, 5)); // "Slice"
//!3-----------------------------------------------------------------------------
// Написати функцію extractAfterSubstring,
// яка приймає два аргументи: рядок str і підрядок substr.
// Функція повинна повертати частину рядка, що йде після першого входження підрядка.
// Якщо підрядок не знайдено, функція повинна повертати порожній рядок.

// function extractAfterSubstring(str, substr) {
//   return str.indexOf(substr) !== -1
//     ? str.slice(str.indexOf(substr) + substr.length)
//     : '';
// }
// // Приклади використання:
// console.log(extractAfterSubstring('Hello, world!', 'world')); // "!"
// console.log(extractAfterSubstring('Hello, world!', 'JavaScript')); // ""
// console.log(extractAfterSubstring('Hello, world!', 'Hello')); // ", world!"
//!4-------------------------------------------------------------------------------
// Написати функцію removeSubstring, яка приймає два аргументи:
// рядок str і підрядок substr.Функція повинна повертати новий рядок,
//   у якому перше входження підрядка буде видалено.Якщо підрядок не знайдено,
//     функція повинна повертати оригінальний рядок.

// function removeSubstring(str, substr) {
//   return str.replace(substr, '');
// }
// // Приклади використання:
// console.log(removeSubstring('Hello, world!', 'world')); // "Hello, !"
// console.log(removeSubstring('Hello, world!', 'JavaScript')); // "Hello, world!"
// console.log(removeSubstring('Hello, world!', 'Hello')); // ", world!"
//!5------------------------------------------------------------------------------
// Написати функцію extractBetween, яка приймає три аргументи:
// рядок str, підрядок start і підрядок end.Функція повинна повертати частину рядка
// між першим входженням підрядка start і підрядка end.Якщо один з підрядків не знайдено,
//   функція повинна повертати порожній рядок.

// function extractBetween(str, start, end) {
//   return str.indexOf(start) !== -1 || str.indexOf(end) !== -1
//     ? str.slice(str.indexOf(start) + 1, str.indexOf(end))
//     : '';
// }
// // Приклади використання:
// console.log(extractBetween('Hello, [world]!', '[', ']')); // "world"
// console.log(extractBetween('Hello, [world]!', '{', '}')); // ""
// console.log(extractBetween('Hello, {world}!', '{', '}')); // "world"
//!6----------------------------------------------------------------------
// Написати функцію removeVowelsFromWords,
//   яка приймає рядок str і повертає новий рядок,
//     у якому з кожного слова видалені всі голосні букви.

// const vowels = 'aeiouAEIOU';

// // Приклади використання:
// console.log(removeVowelsFromWords('Hello, world!')); // "Hll, wrld!"
// console.log(removeVowelsFromWords('JavaScript is awesome!')); // "JvScrpt s wsm!"
// console.log(removeVowelsFromWords('Remove vowels from words')); // "Rmv vwls frm wrds"
